controllers/PostController.php

INSERT INTO `news` (`title`, `content`) VALUES ('yangi posts 1111', 'yangi post update111')
---
    public  function actionCreate(){
        $model = new News();
        if($model->load(\Yii::$app->request->post(),'') and $model->save()){

SELECT * FROM `news` WHERE `id`='2'
---
    public  function actionView($id){
        $model = News::findOne(['id'=>$id]);

SELECT * FROM `news` WHERE `id`='108'
---
    public function actionUpdate($id){

        $model = News::findOne(['id'=>$id]);