modules/v1/controllers/ProductsController.php

    public  function actionCreate(){

        $model = new Products();

        $model->load(\Yii::$app->request->post(),'');

        $file = UploadedFile::getInstanceByName('img');
        if($file){

            $rand = Yii::$app->security->generateRandomString(20);

            $path = "photo/".$rand.".".$file->extension;
            $file->saveAs($path);

            $model->img = $rand.".".$file->extension;
        }else{
            $model->img = "no-img.jpg";
        }

        if($model->save()){
---
INSERT INTO `products` (`name`, `category_id`, `content`, `price`, `img`, `created_at`, `updated_at`) VALUES ('123', 1, 'content content content content ', 10000, 'no-img.jpg', 1665667628, 1665667628)

    public function actionUpdate($id){
        $model = Products::findOne(['id'=>$id]);

            if(!$model){
                return [
                    'succes'=>false,
                    'errors'=>"Bunday id mavjud emas",
                ];
            }

            $name =  $model->img;
            $model->load(\Yii::$app->request->post(),'');

            $file = UploadedFile::getInstanceByName('img');

            if($file){
                if(isset($model->img) && $model->img!="no-img.jpg" && file_exists("@web/photo/".$model->img)){
                    unlink(Url::to("@web/photo/".$model->img));
                }
                $rand = Yii::$app->security->generateRandomString(20);
                $name = $rand.".".$file->extension;
                $path = "photo/".$name;
                $file->saveAs($path);
                $model->img = $name;
            }else{
                $model->img = $name;
            }
            if($model->save()){
---
UPDATE `products` SET `name`='11231231', `img`='PfpRqWMe_jBvsDXqa7lu.jpg', `price`=9000, `updated_at`=1665770916 WHERE `id`=3