modules/v1/controllers/ProductsController.php

    public  function actionCreate(){
        $model = new Products();
        if($model->load(\Yii::$app->request->post(),'') and $model->save()){
---
INSERT INTO `products` (`name`, `category_id`, `content`, `price`, `img`, `created_at`, `updated_at`) VALUES ('samsung 30', 1, 'samsung samsung samsung', 20000, 'img.jpg', 1665646535, 1665646535)

    public function actionView($id){
        $model = Products::findOne(['id'=>$id]);
---
SELECT * FROM `products` WHERE `id`='1'

    public function actionUpdate($id){

        $model = Products::findOne(['id'=>$id]);
        $model->load(\Yii::$app->request->post(),'');

        if($model->save()){
---
SELECT * FROM `products` WHERE `id`='2'
UPDATE `products` SET `price`=20000 WHERE `id`=2

    public function actionDelete($id){
        $model = Products::findOne(['id'=>$id]);
        //$model->load(\Yii::$app->request->post(),'');

        if($model && $model->delete()){
---
SELECT * FROM `products` WHERE `id`='3'
DELETE FROM `products` WHERE `id`=2