modules/v1/controllers/ProductCategoryController.php

    public  function actionCreate(){
        $model = new ProductCategory();
        if($model->load(\Yii::$app->request->post(),'') and $model->save()){
---
INSERT INTO `product_category` (`name`, `created_at`, `updated_at`) VALUES ('321', 1665646437, 1665646437)

    public function actionView($id){
        $model = ProductCategory::findOne(['id'=>$id]);
---
SELECT * FROM `product_category` WHERE `id`='2'

    public function actionUpdate($id){

        $model = ProductCategory::findOne(['id'=>$id]);
---
SELECT * FROM `product_category` WHERE `id`='2'