models/LoginForm.php

    public function login()
    {
        $user = $this->getUser();
        if ($this->validate()) {
            $token = Yii::$app->security->generateRandomString();
            $user->access_token = $token;

            return $user->save()?$token:null;
---
UPDATE `user` SET `updated_at`=1665559217, `access_token`='HJW05CVEdYPlKm1k4P6OdQXX5NWpsQjo' WHERE `id`=2